// FileSyncUI Localizable.strings

// The name of the product
"FileSyncUI" = "Synchronizacja pliku";

// Text of "ok" button, used in various dialogs.
"OK" = "OK";

// Text of "cancel" button, used in various dialogs.
"CANCEL" = "Anuluj";

// Text of "Next" button, used in various dialogs
"NEXT" = "Następne";

// Text of "Done" button, used in various dialogs
"DONE" = "Gotowe";

// Text of "Continue" button, used in various dialogs
"CONTINUE" = "Dalej";


// ------------------------
// Exception (error) window

"DESTINATION:" = "Miejsce docelowe:";	// Destination label - prefixes the destination path of a symlink.
"MODIFIED:"    = "Zmiany:";		// Modified label - prefixes the displayed mod date
"NAME:"        = "Nazwa:";			// Name label - prefixes the name of the file
"SIZE:"        = "Wielkość:";			// Size label - prefixes the displayed size of the file
"IDISK"		   = "iDisk";			// Prefixing the path with "iDisk/" when appropriate

// These labels tell the user which side of the mirror the file which caused the error resides on
"THIS_COMPUTER" = "Na tym komputerze";	// For iDisk
".MAC"          = "Na %@";				// For iDisk
"LOCAL_MHD"     = "Na tym komputerze";	// For Mobile Home Directories (MHD)
"REMOTE_MHD"    = "W sieci";		// For MHD

// To reveal the errored file in Finder when appropriate
"SHOW IN FINDER" = "Pokaż w Finderze";


// ------------------------
// Exception (error) dialog

// The title of the exception dialog.
"IDISK ERROR TITLE" = "Błąd iDisku";
"MHD ERROR TITLE"   = "Błąd synchronizacji katalogu domowego";
"FS ERROR TITLE"    = "Błąd synchronizacji pliku";

// Error code. The argument is an integer number, such as -43.
"ERROR%" = "Kod błędu wynosi %d.";

// Exception count.
// The first argument is an integer index, the second is the total number of errors. E.g., "iDisk Error 1 of 5"
"IDISK ERROR COUNT%" = "Błąd iDisku %d z %d";
"MHD ERROR COUNT%"   = "Błąd synchronizacji katalogu domowego %d z %d";
"FS ERROR COUNT%"    = "Błąd synchronizacji pliku %d z %d";

// Title text of the error. Two variations, only one is used at a time.
// The argument is a filename.
"ERROR DELETING%"      = "Wystąpił problem podczas usuwania pliku „%@”.";
"ERROR SYNCING%"       = "Jest problem z synchronizacją pliku „%@”.";
"ERROR MOVING%"        = "Wystąpił problem podczas przenoszenia pliku „%@”.";
"ERROR ACCESSING%"     = "Jest problem z synchronizacją pliku „%@”.";
"DIR:ERROR DELETING%"  = "Wystąpił problem z usunięciem katalogu „%@”.";
"DIR:ERROR SYNCING%"   = "Wystąpił problem z synchronizacją katalogu „%@”.";
"DIR:ERROR MOVING%"    = "Wystąpił problem z przesunięciem katalogu „%@”.";
"DIR:ERROR ACCESSING%" = "Wystąpił problem z synchronizacją katalogu „%@”.";


// ------------------------
// Exception dialog error messages.
// The first string is a short description of the error.
// The second string is additional help text.

// dskFulErr
// The first three strings are variations of the short description: iDisk, mobile home, and general syncing.
"IDISK DSKFULERR"      = "iDisk jest prawie pełny. Nie ma wystarczająco dużo miejsca na iDisku, aby zsynchronizować tę rzecz.";
"MHD DSKFULERR"        = "Katalog domowy jest prawie pełny. Nie ma wystarczająco dużo miejsca, aby zsynchronizować tę rzecz.";
"FS DSKFULERR"         = "Dysk jest prawie pełny. Nie ma wystarczająco dużo miejsca do synchronizacji tej rzeczy.";
"IDISK DSKFULERR HELP" = "Niektóre rzeczy z Twojego iDisku znajdują się w koszu. Aby zwolnić trochę miejsca, opróżnij kosz.";

// afpAccessDenied
// The first two strings are variations of the short description: deleting, syncing
"AFPACCESSDENIED DELETE"     = "Nie masz uprawnień do usuwania tego pliku.";
"AFPACCESSDENIED SYNC"       = "Nie masz uprawnień do synchronizowania tego pliku.";
"DIR:AFPACCESSDENIED DELETE" = "Nie masz uprawnień do usunięcia tego katalogu.";
"DIR:AFPACCESSDENIED SYNC"   = "Nie masz uprawnień do synchronizowania tego katalogu.";
"AFPACCESSDENIED HELP"       = "Możesz sprawdzić swoje uprawnienia w panelu Informacje w Finderze.";

// kSFFileNameDiffersByCase
// The first three strings are variations of the short description: iDisk, mobile home, general syncing.
"IDISK KSFFILENAMEDIFFERSBYCASE"     = "Nazwa tego pliku jest taka sama, co nazwa innej rzeczy na twoim iDisku, z wyjątkiem różnic liter dużych i małych.";
"MHD KSFFILENAMEDIFFERSBYCASE"       = "Nazwa tego pliku jest taka sama, co nazwa innej rzeczy w twoim katalogu domowym, z wyjątkiem różnic liter dużych i małych.";
"FS KSFFILENAMEDIFFERSBYCASE"        = "Nazwa tego pliku jest taka sama, co nazwa innej rzeczy na twoim dysku, z wyjątkiem różnic liter dużych i małych.";
"DIR:IDISK KSFFILENAMEDIFFERSBYCASE" = "Nazwa tego katalogu jest taka sama, co nazwa innej rzeczy na iDisku, z wyjątkiem różnic liter dużych i małych.";
"DIR:MHD KSFFILENAMEDIFFERSBYCASE"   = "Nazwa tego katalogu jest taka sama, co nazwa innej rzeczy w twoim katalogu domowym, z wyjątkiem różnic liter dużych i małych.";
"DIR:FS KSFFILENAMEDIFFERSBYCASE"    = "Nazwa tego katalogu jest taka sama, co nazwa innej rzeczy na dysku, z wyjątkiem różnic liter dużych i małych.";
"KSFFILENAMEDIFFERSBYCASE HELP"      = "Należy zmienić nazwę tej rzeczy, aby różniła się w bardziej istotny sposób. Na przykład, dodaj cyfrę do nazwy.";

// fBsyErr
"FSBSYERR"      = "Ten plik jest używany.";
"FSBSYERR HELP" = "Jakiś program może mieć otwarty plik. Spróbuj zamknąć ten plik lub zakończ pracę programów.";

// fLckdErr
"FLCKDERR"      = "Plik jest zablokowany.";
"DIR:FLCKDERR"  = "Ten katalog jest zablokowany.";
"FLCKDERR HELP" = "Możesz odblokować tę rzecz w panelu Informacje w Finderze.";

"File Not Found"      = "Plik nie został znaleziony.";
"HELP:File Not Found" = "Plik mógł zostać przeniesiony podczas synchronizacji. Spróbuj synchronizować później.";

"File Name Too Long"      = "Nazwa pliku lub katalogu jest za długa.";
"HELP:File Name Too Long" = "Zmień nazwę tej rzeczy, by miała krótszą nazwę.";

"I/O Error"      = "Wystąpił błąd podczas czytania lub zapisu pliku";
"HELP:I/O Error" = "Spróbuj ponownie później.";

"Destination does not support symlinks"      = "W miejscu docelowym nie są obsługiwane łącza symboliczne.";
"HELP:Destination does not support symlinks" = "Spróbuj najpierw skompresować plik lub katalog.";

"Object deleted"      = "Ta rzecz została usunięta, zanim mogła być zsynchronizowana.";
//"HELP:Object deleted" = "";

"Object created"      = "Nowa rzecz została utworzona w tym samym miejscu, co rzecz poprzednio zsynchronizowana.";
//"HELP:Object created" = "";

"Object modified"     = "Ta rzecz przeznaczona do synchronizacji była modyfikowana, zanim mogła być zsynchronizowana.";
//"HELP:Object modified" = "";

"Network error"       = "Wystąpił błąd sieci.";
"HELP:Network error"  = "Sprawdź połączenie sieciowe lub spróbuj ponownie później.";

//"Timeout Error"       = "The server has stopped responding.";

"Unknown error"            = "Wystąpił problem.";					// [rdar://5231555]
"HELP:Unknown error"       = "Spróbuj ponownie później.";
"HELP-IDISK:Unknown error" = "Spróbuj ponownie później.";
"HELP-PHD:Unknown error"   = "Spróbuj ponownie później. Jeśli problem będzie się powtarzał, skontaktuj się z administratorem sieci.";

"IDISK ALMOST FULL"     = "Twój iDisk jest prawie pełny.";
"ALMOST FULL TRASH MSG" = "Niektóre pliki z Twojego iDisku znajdują się w koszu. Aby zwiększyć ilość dostępnego miejsca, opróżnij kosz.\n\nPojemność iDisku możesz także zwiększyć w panelu %@, znajdującym się w oknie Preferencji systemowych.";
"ALMOST FULL .MAC MSG"  = "Pojemność iDisku możesz zwiększyć w panelu %@ preferencji systemowych.";

"REVERIFICATION"      = "Ten plik zmieniał się podczas wszystkich ostatnich %@ synchronizacji.";
"REVERIFICATION HELP" = "Jakiś program może co pewien czas zmieniać ten plik. Spróbuj zamknąć plik lub wszystkie otwarte programy.";

"TOO_MANY_EAS"      = "W miejscu docelowym nie są obsługiwane niektóre dane, znajdujące się w tej rzeczy.";
"TOO_MANY_EAS HELP" = "Spróbuj najpierw skompresować plik lub katalog.";

// ---------------------
// offline folder dialog

"OFFLINE FOLDER%"    = "Katalog %@ jest dostępny, gdy twój iDisk jest w sieci.";
"OFFLINE FOLDER MSG" = "Aby mieć dostęp do tego katalogu, musisz połączyć swój komputer z Internetem.";


// Size formats, used in the conflict and exception dialog to show file sizes.
// The argument is the number of bytes, the suffixes are the abbreviations for the standard metric scales: kilobytes, megabytes, etc.
"%BYTES" = "%llu B";
"%KB"    = "%.2f KB";
"%MB"    = "%.2f MB";
"%GB"    = "%.2f GB";
"%TB"    = "%.2f TB";
"%PB"    = "%.2f PB";
"%XB"    = "%.2f XB";


// --------------------
// Conflict list window

// Conflict count. Singular and plural. The plural argument is an integer. Used in the conflict *list* window, not the conflict resolution window
"1CONFLICT"  = "1 konflikt";
"%CONFLICTS" = "%d konflikty";


// -----------------------
// Conflict manager window

"%IS_OUT_OF_SYNC"          = "Rzecz „%@” została zmodyfikowana w obu miejscach.";			// Name of conflicting item.
"%WHERE"                   = "Gdzie: %@";						// Path to parent folder of conflicting item.
"%CONFLICT_COUNT"          = "%d z %d";						// Conflict count (arguments are integers i.e., "1 of 16")
"ROOT"                     = "-root-";							// The name of the root of the sync point, rather than @"/"
"FILE"                     = "plik";
"FOLDER"                   = "katalog";
"PACKAGE"                  = "pakiet";
"SYMLINK"                  = "łącze symboliczne";
"IDISK_LOCAL_TITLE"        = "Ten komputer";
"IDISK_POPUP_LOCAL_TITLE"  = "Zatrzymaj plik na tym komputerze";
"IDISK_POPUP_REMOTE_TITLE" = "Pozostaw plik na %@";
"MHD_LOCAL_TITLE"          = "Na tym komputerze";
"MHD_REMOTE_TITLE"         = "W sieci";
"MHD_POPUP_LOCAL_TITLE"    = "Zatrzymaj plik na tym komputerze";
"MHD_POPUP_REMOTE_TITLE"   = "Zatrzymaj plik w sieci";
"1_IDISK_CONFLICT"         = "Wystąpił konflikt synchronizacji iDisku.";			// Singular for iDisk
"%_IDISK_CONFLICTS"        = "Odnotowano wystąpienie %d konfliktów synchronizacji iDisku.";			// Plural for iDisk
"1_MHD_CONFLICT"           = "Wystąpił konflikt synchronizacji katalogu domowego.";				// Singular for MHD
"%_MHD_CONFLICTS"          = "Odnotowano wystąpienie %d konfliktów synchronizacji katalogu domowego.";			// Plural for MHD
"IDISK_RESOLVE_REMOTE"     = "Rozwiąż wszystkie konflikty, używając plików z %@";
"IDISK_RESOLVE_LOCAL"      = "Rozwiąż wszystkie konflikty, używając plików z tego komputera";
"IDISK_RESOLVE_BOTH"       = "Rozwiąż wszystkie konflikty zatrzymując oba pliki";
"IDISK_RESOLVE_LASTMOD"    = "Rozwiąż wszystkie konflikty, zachowując plik z nowszą datą modyfikacji.";
"IDISK_RESOLVE_EXCLUDE"    = "Rozwiąż wszystkie konflikty wyłączając te pliki z przyszłych synchronizacji.";
"IDISK_RESOLVE_NONE"       = "Ignoruj wszystkie konflikty.";
"MHD_RESOLVE_REMOTE"       = "Rozwiąż wszystkie konflikty, używając plików z sieci";
"MHD_RESOLVE_LOCAL"        = "Rozwiąż wszystkie konflikty, używając plików z tego komputera";
"MHD_RESOLVE_BOTH"         = "Rozwiąż wszystkie konflikty zatrzymując oba pliki";
"MHD_RESOLVE_LASTMOD"      = "Rozwiąż wszystkie konflikty, zachowując plik z nowszą datą modyfikacji.";
"MHD_RESOLVE_EXCLUDE"      = "Rozwiąż wszystkie konflikty wyłączając te pliki z przyszłych synchronizacji.";
"MHD_RESOLVE_NONE"         = "Ignoruj wszystkie konflikty.";
"MHD_CONFLICT_TITLE"       = "Konflikty synchronizacji";

// Unable to resolve all conflicts alert sheet
"NOT_ALL_RESOLVED_TITLE" = "Nie można rozwiązać wszystkich konfliktów";
"NOT_ALL_RESOLVED_MSG"   = "Niektórych konfliktów nie można było rozwiązać, gdyż ich daty modyfikacji są zbyt blisko siebie. Rozwiąż te konflikty ręcznie lub skorzystaj z innej opcji.";

"There are no file syncing errors or conflicts." = "Nie ma błędów synchronizacji plików lub konfliktów.";

// -----------------
// Global Exceptions

// iDisk
"GLOBAL-IDISK:Timeout"      = "Synchronizacja iDisku nie została ukończona. Spróbuj ponownie później.";
"GLOBAL-HELP-IDISK:Timeout" = "Jeżeli problemy z synchronizacją iDisku będą występowały nadal, powodem mogą być kłopoty z połączeniem sieciowym. Spróbuj zakończyć pracę pozostałych programów, które korzystają z Internetu.";

"GLOBAL-IDISK:NetworkError"      = "Synchronizacja iDisku nie została ukończona.";
"GLOBAL-HELP-IDISK:NetworkError" = "Sprawdź połączenie sieciowe lub spróbuj ponownie później.";

"GLOBAL-IDISK:RemoteBusy"      = "Synchronizacja iDisku nie została ukończona.";
"GLOBAL-HELP-IDISK:RemoteBusy" = "Spróbuj ponownie później.";

"GLOBAL-IDISK:UNKNOWN"      = "Synchronizacja iDisku nie została ukończona, ponieważ wystąpił błąd.";
"GLOBAL-HELP-IDISK:UNKNOWN" = "Spróbuj ponownie później.";

// PHD
"GLOBAL-PHD:Timeout"      = "Synchronizacja katalogu domowego nie została ukończona. Spróbuj ponownie później.";
"GLOBAL-HELP-PHD:Timeout" = "Jeżeli problemy z synchronizacją katalogu domowego będą występowały nadal, powodem mogą być kłopoty z połączeniem sieciowym. Spróbuj zakończyć pracę pozostałych programów, które korzystają z sieci.";

"GLOBAL-PHD:NetworkError"      = "Synchronizacja katalogu domowego nie została ukończona.";
"GLOBAL-HELP-PHD:NetworkError" = "Sprawdź połączenie sieciowe lub spróbuj ponownie później.";

"GLOBAL-PHD:RemoteBusy"      = "Synchronizacja katalogu domowego nie została ukończona.";
"GLOBAL-HELP-PHD:RemoteBusy" = "Spróbuj ponownie później.";

"GLOBAL-PHD:UNKNOWN"      = "Synchronizacja katalogu domowego nie została ukończona, ponieważ wystąpił błąd.";
"GLOBAL-HELP-PHD:UNKNOWN" = "Spróbuj ponownie później.";

// Other
"GLOBAL-FS:Timeout"      = "Synchronizacja plików nie została ukończona. Spróbuj ponownie później.";
"GLOBAL-HELP-FS:Timeout" = "Jeżeli problemy z synchronizacją plików będą występowały nadal, powodem mogą być kłopoty z połączeniem sieciowym. Spróbuj zakończyć pracę pozostałych programów, które korzystają z sieci.";

"GLOBAL-FS:NetworkError"      = "Synchronizacja plików nie została ukończona.";
"GLOBAL-HELP-FS:NetworkError" = "Sprawdź połączenie sieciowe lub spróbuj ponownie później.";

"GLOBAL-FS:RemoteBusy"      = "Synchronizacja plików nie została ukończona.";
"GLOBAL-HELP-FS:RemoteBusy" = "Spróbuj ponownie później.";

"GLOBAL-FS:UNKNOWN"      = "Synchronizacja plików nie została ukończona, ponieważ wystąpił błąd.";
"GLOBAL-HELP-FS:UNKNOWN" = "Spróbuj ponownie później.";
